       01 ACCT-DETAILS.
             03 ACCT-NUMBER PIC     X(05).
             03 CUST-NAME   PIC     X(10).
             03 ACCT-BAL    PIC     S9(03)V9(02).
             03 ACCT-TYPE   PIC     X(10).