//TUSER30 JOB NOTIFY=&SYSUID
//STEP1   EXEC  PGM=CARDPGM1
//STEPLIB   DD  DSN=MMD.ANILL.COBOL.LOAD,DISP=SHR
//SYSPRINT  DD SYSOUT=*
//SYSOUT    DD SYSOUT=*
//SYSIN  DD *
C1111
MAMD
20000
05000
Y
C2222
ALII
10000
05000
Y
C3333
AHMD
10000
02000
Y
C4444

10000
02000
N
/*
//
