       ID DIVISION.
       PROGRAM-ID. CARDPGM1.
       AUTHOR. NAME.
       DATE-WRITTEN. TODAY.

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.

       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       01 CARD-DETAILS-IN.
           03 CARD-NUMBER   PIC   X(05).
           03 CUST-NAME     PIC   X(10).
           03 CARD-LIMIT    PIC  S9(05).
           03 CARD-DUE-AMT  PIC  S9(05).

       01 CARD-DETAILS-OUT.
           03 CARD-NUMBER   PIC   X(05) VALUE SPACE.
           03 CUST-NAME     PIC   X(10) VALUE SPACE.
           03 CARD-LIMIT    PIC  S9(05) VALUE ZERO.
           03 CARD-DUE-AMT  PIC  S9(05) VALUE ZERO.

       01  WS-ANY-MORE-INPUT   PIC   X(01)  VALUE SPACE.
       01  WS-VALID-INPUT      PIC   X(01)  VALUE SPACE.
       01  WS-IN-REC-CNT       PIC   9(02)  VALUE ZERO.
       01  WS-OT-REC-CNT       PIC   9(02)  VALUE ZERO.

       PROCEDURE DIVISION.
       000-MAIN-PARA.
           DISPLAY  'CARDPGM1 STARTED'.

           PERFORM  100-INITIAL-PARA  THRU 100-EXIT
           PERFORM  200-GET-INPUT-PARA  THRU 200-EXIT
           PERFORM  300-PROCESS-PARA  THRU 300-EXIT
                           UNTIL  WS-ANY-MORE-INPUT = 'N'.

           DISPLAY  'TOTAL  INPUT REC COUNT  '  WS-IN-REC-CNT.
           DISPLAY  'TOTAL  OUTPUT REC COUNT '  WS-OT-REC-CNT.
           STOP RUN.

       100-INITIAL-PARA.
           MOVE   ZERO    TO   WS-IN-REC-CNT
                               WS-OT-REC-CNT.

           MOVE   'Y'     TO   WS-ANY-MORE-INPUT.

           MOVE   SPACE  TO   CARD-NUMBER OF CARD-DETAILS-IN
                              CUST-NAME   OF CARD-DETAILS-IN.
           MOVE   ZERO   TO   CARD-LIMIT  OF CARD-DETAILS-IN
                              CARD-DUE-AMT OF CARD-DETAILS-IN.

       100-EXIT. EXIT.

       200-GET-INPUT-PARA.
           ACCEPT  CARD-NUMBER OF CARD-DETAILS-IN
           ACCEPT  CUST-NAME   OF CARD-DETAILS-IN.
           ACCEPT  CARD-LIMIT  OF CARD-DETAILS-IN
           ACCEPT  CARD-DUE-AMT OF CARD-DETAILS-IN.
           ADD  +1    TO   WS-IN-REC-CNT.
       200-EXIT. EXIT.

       300-PROCESS-PARA.
           MOVE  'Y'   TO  WS-VALID-INPUT.
           PERFORM  310-AUDIT-INPUT-PARA  THRU 310-EXIT.

           IF  WS-VALID-INPUT = 'Y'
               PERFORM  340-MOVE-DISPLAY-PARA  THRU 340-EXIT
           END-IF.

           ACCEPT  WS-ANY-MORE-INPUT.
           IF WS-ANY-MORE-INPUT = 'Y'
               PERFORM  200-GET-INPUT-PARA  THRU 200-EXIT
           END-IF.
       300-EXIT. EXIT.

       310-AUDIT-INPUT-PARA.
           IF CARD-NUMBER OF CARD-DETAILS-IN = SPACE
               MOVE  'N'   TO  WS-VALID-INPUT
               GO TO 310-EXIT
           END-IF.

           IF CUST-NAME OF  CARD-DETAILS-IN = SPACE
               MOVE  'N'  TO  WS-VALID-INPUT
               GO TO 310-EXIT
           END-IF.

           IF CARD-LIMIT OF CARD-DETAILS-IN < 0
               MOVE  'N'   TO WS-VALID-INPUT
               GO TO 310-EXIT
           END-IF.

           IF CARD-DUE-AMT OF CARD-DETAILS-IN < 0
               MOVE  'N'   TO  WS-VALID-INPUT
           END-IF.

       310-EXIT. EXIT.

       340-MOVE-DISPLAY-PARA.
           MOVE  CARD-NUMBER OF CARD-DETAILS-IN   TO
                         CARD-NUMBER OF CARD-DETAILS-OUT.
           MOVE  CUST-NAME   OF CARD-DETAILS-IN   TO
                         CUST-NAME   OF CARD-DETAILS-OUT.
           MOVE  CARD-LIMIT  OF CARD-DETAILS-IN   TO
                         CARD-LIMIT  OF CARD-DETAILS-OUT.
           MOVE  CARD-DUE-AMT OF CARD-DETAILS-IN  TO
                          CARD-DUE-AMT OF CARD-DETAILS-OUT.

           DISPLAY  'VALID CARD DETAILS ARE ' CARD-DETAILS-OUT.
           ADD +1  TO  WS-OT-REC-CNT.

       340-EXIT. EXIT.
