//COBCOMP  JOB  CLASS=A,MSGCLASS=1,MSGLEVEL=(1,1),NOTIFY=&SYSUID       
//PROCLIB JCLLIB ORDER=MMD.ANILL.COBOL                                 
//*******************************************************************  
//* COMPILE AND LINK EDIT A COBOL PROGRAM                              
//*******************************************************************  
//STEP1 EXEC COMPPROC,                                                 
//           SRCCOB=MMD.ANILL.COBOL(ACCTPGM1),                         
//           COPYBOOK=MMD.ANILL.COBOL.COPYLIB,                         
//           LOADPATH=MMD.ANILL.COBOL.LOAD(ACCTPGM1)                   
